; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-2-189)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-0 - location
	p1-2 - location
	p0-2 - location
	p3-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s2)
	(at package2 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 16)
	(= (time-to-walk p1-0 s1) 16)
	(= (time-to-walk s0 p1-0) 13)
	(= (time-to-walk p1-0 s0) 13)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 28)
	(= (time-to-walk p1-2 s1) 28)
	(= (time-to-walk s2 p1-2) 69)
	(= (time-to-walk p1-2 s2) 69)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 40)
	(= (time-to-walk p0-2 s0) 40)
	(= (time-to-walk s2 p0-2) 48)
	(= (time-to-walk p0-2 s2) 48)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 40)
	(= (time-to-walk p3-1 s3) 40)
	(= (time-to-walk s1 p3-1) 53)
	(= (time-to-walk p3-1 s1) 53)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 53)
	(= (time-to-drive s0 s2) 53)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 52)
	(= (time-to-drive s1 s2) 52)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 62)
	(= (time-to-drive s2 s3) 62)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 4)
	(= (time-to-drive s0 s1) 4)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 67)
	(= (time-to-drive s3 s1) 67)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s3)
	(at driver3 s3)
	(at truck1 s1)
	(at truck2 s3)
	(at truck3 s2)
	(at truck4 s3)
	(at truck5 s0)
	(at package1 s2)
	(at package2 s3)
	))

(:metric minimize (+ (* 2 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 10
2. (drive-truck truck4 s1 s3 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 0 to 670
   goals met: 4 of 10
3. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 10
4. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 670 to 1290
   goals met: 4 of 10
5. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 5 of 10
6. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 4 of 10
7. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 5 of 10
8. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 5 of 10
9. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 5 of 10
10. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 10
11. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 1290 to 1910
   goals met: 6 of 10
12. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 1910 to 2440
   goals met: 5 of 10
13. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 2440 to 2970
   goals met: 5 of 10
14. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 2970 to 3590
   goals met: 6 of 10
15. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 7 of 10
16. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 6 of 10
17. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 3590 to 4260
   goals met: 7 of 10
18. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 7 of 10
19. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 4260 to 4300
   goals met: 6 of 10
20. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 6 of 10
21. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 10
22. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
23. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 4300 to 4830
   goals met: 6 of 10
24. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 4830 to 5450
   goals met: 6 of 10
25. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 7 of 10
26. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 10
27. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 5450 to 6120
   goals met: 7 of 10
28. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 6120 to 6160
   goals met: 6 of 10
29. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 6160 to 6690
   goals met: 7 of 10
30. (drive-truck truck3 s2 s3 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 6690 to 7310
   goals met: 6 of 10
31. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 7 of 10
32. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 10
33. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 7310 to 7930
   goals met: 7 of 10
34. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 7 of 10
35. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 7930 to 8550
   goals met: 6 of 10
36. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 7 of 10
37. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
38. (walk driver1 s0 p1-0)
   deleted: (at driver1 s0)
   added: (at driver1 p1-0)
   goals met: 6 of 10
39. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 8550 to 9170
   goals met: 7 of 10
40. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 7 of 10
41. (walk driver1 p1-0 s1)
   deleted: (at driver1 p1-0)
   added: (at driver1 s1)
   goals met: 7 of 10
42. (walk driver1 s1 p3-1)
   deleted: (at driver1 s1)
   added: (at driver1 p3-1)
   goals met: 7 of 10
43. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 7 of 10
44. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 7 of 10
45. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 7 of 10
46. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 9170 to 9700
   goals met: 6 of 10
47. (drive-truck truck5 s2 s3 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (fuel-used) from 9700 to 10320
   goals met: 6 of 10
48. (walk driver1 p3-1 s1)
   deleted: (at driver1 p3-1)
   added: (at driver1 s1)
   goals met: 6 of 10
49. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 6 of 10
50. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 7 of 10
51. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 7 of 10
52. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 10
53. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 6 of 10
54. (drive-truck truck5 s3 s2 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (fuel-used) from 10320 to 10940
   goals met: 6 of 10
55. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 10940 to 11470
   goals met: 7 of 10
56. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 7 of 10
57. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 11470 to 11510
   goals met: 8 of 10
58. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 8 of 10
59. (walk driver2 s0 p1-0)
   deleted: (at driver2 s0)
   added: (at driver2 p1-0)
   goals met: 8 of 10
60. (walk driver1 s1 p3-1)
   deleted: (at driver1 s1)
   added: (at driver1 p3-1)
   goals met: 8 of 10
61. (walk driver1 p3-1 s3)
   deleted: (at driver1 p3-1)
   added: (at driver1 s3)
   goals met: 9 of 10
62. (walk driver2 p1-0 s1)
   deleted: (at driver2 p1-0)
   added: (at driver2 s1)
   goals met: 9 of 10
63. (walk driver2 s1 p3-1)
   deleted: (at driver2 s1)
   added: (at driver2 p3-1)
   goals met: 9 of 10
64. (walk driver2 p3-1 s3)
   deleted: (at driver2 p3-1)
   added: (at driver2 s3)
   goals met: 10 of 10
